test/cwmp_builder_SUITE_data/cwmp_ScheduleDownload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0"><soapenv:Header/><soapenv:Body><cwmp:ScheduleDownload><CommandKeyType/><DownloadFileType>1</DownloadFileType><URL>http://announceURL-FwUpgr/</URL><Username/><Password/><FileSize>2010</FileSize><TargetFileName/><TimeWindowList soapenc:arrayType="cwmp:TimeWindowStruct[1]"><cwmp:TimeWindowStruct><WindowStart>2</WindowStart><WindowEnd>3</WindowEnd><TimeWindowModeValueType/><UserMessage/><MaxRetries>2</MaxRetries></cwmp:TimeWindowStruct></TimeWindowList></cwmp:ScheduleDownload></soapenv:Body></soapenv:Envelope>